In [14]:
# pip install jupyter notebook
# pip install pandas
# pip install openpyxl

In [38]:
import pandas
import numpy as np

In [17]:
data = pandas.read_excel("c:/users/croma campus/Downloads/Financial_Sample.xlsx")

In [18]:
data

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,NaN,1618.5,3,20.0,32370.0,0.00,32370.00,16185.0,16185.00,2014-01-01,1,January,2014
1,Government,Germany,Carretera,NaN,1321.0,3,20.0,26420.0,0.00,26420.00,13210.0,13210.00,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,NaN,2178.0,3,15.0,32670.0,0.00,32670.00,21780.0,10890.00,2014-06-01,6,June,2014
3,Midmarket,Germany,Carretera,NaN,888.0,3,15.0,13320.0,0.00,13320.00,8880.0,4440.00,2014-06-01,6,June,2014
4,Midmarket,Mexico,Carretera,NaN,2470.0,3,15.0,37050.0,0.00,37050.00,24700.0,12350.00,2014-06-01,6,June,2014
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
695,Small Business,France,Amarilla,High,2475.0,260,300.0,742500.0,111375.00,631125.00,618750.0,12375.00,2014-03-01,3,March,2014
696,Small Business,Mexico,Amarilla,High,546.0,260,300.0,163800.0,24570.00,139230.00,136500.0,2730.00,2014-10-01,10,October,2014
697,Government,Mexico,Montana,High,1368.0,5,7.0,9576.0,1436.40,8139.60,6840.0,1299.60,2014-02-01,2,February,2014
698,Government,Canada,Paseo,High,723.0,10,7.0,5061.0,759.15,4301.85,3615.0,686.85,2014-04-01,4,April,2014
699,Channel Partners,United States of America,VTT,High,1806.0,250,12.0,21672.0,3250.80,18421.20,5418.0,13003.20,2014-05-01,5,May,2014

In [19]:
data.head()

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,NaN,1618.5,3,20.0,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,NaN,1321.0,3,20.0,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,NaN,2178.0,3,15.0,32670.0,0.0,32670.0,21780.0,10890.0,2014-06-01,6,June,2014
3,Midmarket,Germany,Carretera,NaN,888.0,3,15.0,13320.0,0.0,13320.0,8880.0,4440.0,2014-06-01,6,June,2014
4,Midmarket,Mexico,Carretera,NaN,2470.0,3,15.0,37050.0,0.0,37050.0,24700.0,12350.0,2014-06-01,6,June,2014

In [20]:
data.head(3)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,NaN,1618.5,3,20.0,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,NaN,1321.0,3,20.0,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,NaN,2178.0,3,15.0,32670.0,0.0,32670.0,21780.0,10890.0,2014-06-01,6,June,2014

In [21]:
data.tail()

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
695,Small Business,France,Amarilla,High,2475.0,260,300.0,742500.0,111375.00,631125.00,618750.0,12375.00,2014-03-01,3,March,2014
696,Small Business,Mexico,Amarilla,High,546.0,260,300.0,163800.0,24570.00,139230.00,136500.0,2730.00,2014-10-01,10,October,2014
697,Government,Mexico,Montana,High,1368.0,5,7.0,9576.0,1436.40,8139.60,6840.0,1299.60,2014-02-01,2,February,2014
698,Government,Canada,Paseo,High,723.0,10,7.0,5061.0,759.15,4301.85,3615.0,686.85,2014-04-01,4,April,2014
699,Channel Partners,United States of America,VTT,High,1806.0,250,12.0,21672.0,3250.80,18421.20,5418.0,13003.20,2014-05-01,5,May,2014

In [22]:
data.tail(3)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
697,Government,Mexico,Montana,High,1368.0,5,7.0,9576.0,1436.40,8139.60,6840.0,1299.60,2014-02-01,2,February,2014
698,Government,Canada,Paseo,High,723.0,10,7.0,5061.0,759.15,4301.85,3615.0,686.85,2014-04-01,4,April,2014
699,Channel Partners,United States of America,VTT,High,1806.0,250,12.0,21672.0,3250.80,18421.20,5418.0,13003.20,2014-05-01,5,May,2014

In [23]:
data.head(25)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,NaN,1618.5,3,20.0,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,NaN,1321.0,3,20.0,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,NaN,2178.0,3,15.0,32670.0,0.0,32670.0,21780.0,10890.0,2014-06-01,6,June,2014
3,Midmarket,Germany,Carretera,NaN,888.0,3,15.0,13320.0,0.0,13320.0,8880.0,4440.0,2014-06-01,6,June,2014
4,Midmarket,Mexico,Carretera,NaN,2470.0,3,15.0,37050.0,0.0,37050.0,24700.0,12350.0,2014-06-01,6,June,2014
5,Government,Germany,Carretera,NaN,1513.0,3,350.0,529550.0,0.0,529550.0,393380.0,136170.0,2014-12-01,12,December,2014
6,Midmarket,Germany,Montana,NaN,921.0,5,15.0,13815.0,0.0,13815.0,9210.0,4605.0,2014-03-01,3,March,2014
7,Channel Partners,Canada,Montana,NaN,2518.0,5,12.0,30216.0,0.0,30216.0,7554.0,22662.0,2014-06-01,6,June,2014
8,Government,France,Montana,NaN,1899.0,5,20.0,37980.0,0.0,37980.0,18990.0,18990.0,2014-06-01,6,June,2014
9,Channel Partners,Germany,Montana,NaN,1545.0,5,12.0,18540.0,0.0,18540.0,4635.0,13905.0,2014-06-01,6,June,2014
10,Midmarket,Mexico,Montana,NaN,2470.0,5,15.0,37050.0,0.0,37050.0,24700.0,12350.0,2014-06-01,6,June,2014
11,Enterprise,Canada,Montana,NaN,2665.5,5,125.0,333187.5,0.0,333187.5,319860.0,13327.5,2014-07-01,7,July,2014
12,Small Business,Mexico,Montana,NaN,958.0,5,300.0,287400.0,0.0,287400.0,239500.0,47900.0,2014-08-01,8,August,2014
13,Government,Germany,Montana,NaN,2146.0,5,7.0,15022.0,0.0,15022.0,10730.0,4292.0,2014-09-01,9,September,2014
14,Enterprise,Canada,Montana,NaN,345.0,5,125.0,43125.0,0.0,43125.0,41400.0,1725.0,2013-10-01,10,October,2013
15,Midmarket,United States of America,Montana,NaN,615.0,5,15.0,9225.0,0.0,9225.0,6150.0,3075.0,2014-12-01,12,December,2014
16,Government,Canada,Paseo,NaN,292.0,10,20.0,5840.0,0.0,5840.0,2920.0,2920.0,2014-02-01,2,February,2014
17,Midmarket,Mexico,Paseo,NaN,974.0,10,15.0,14610.0,0.0,14610.0,9740.0,4870.0,2014-02-01,2,February,2014
18,Channel Partners,Canada,Paseo,NaN,2518.0,10,12.0,30216.0,0.0,30216.0,7554.0,22662.0,2014-06-01,6,June,2014
19,Government,Germany,Paseo,NaN,1006.0,10,350.0,352100.0,0.0,352100.0,261560.0,90540.0,2014-06-01,6,June,2014
20,Channel Partners,Germany,Paseo,NaN,367.0,10,12.0,4404.0,0.0,4404.0,1101.0,3303.0,2014-07-01,7,July,2014
21,Government,Mexico,Paseo,NaN,883.0,10,7.0,6181.0,0.0,6181.0,4415.0,1766.0,2014-08-01,8,August,2014
22,Midmarket,France,Paseo,NaN,549.0,10,15.0,8235.0,0.0,8235.0,5490.0,2745.0,2013-09-01,9,September,2013
23,Small Business,Mexico,Paseo,NaN,788.0,10,300.0,236400.0,0.0,236400.0,197000.0,39400.0,2013-09-01,9,September,2013
24,Midmarket,Mexico,Paseo,NaN,2472.0,10,15.0,37080.0,0.0,37080.0,24720.0,12360.0,2014-09-01,9,September,2014

In [24]:
data = {
    'EMPID':[101,102,103,104,105,106,107,108,109,110],
    'EMP_Name':['Raj','Anu','Manu','Rahul','Ram','Shyam','Mohan','Rohan','Shiva','Vikas'],
    'EMP_Salary':[24345,76654,87675,23344,67563,78999,34566,87887,78009,43665]
}

In [25]:
df =

{'EMPID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
 'EMP_Name': ['Raj',
  'Anu',
  'Manu',
  'Rahul',
  'Ram',
  'Shyam',
  'Mohan',
  'Rohan',
  'Shiva',
  'Vikas'],
 'EMP_Salary': [24345,
  76654,
  87675,
  23344,
  67563,
  78999,
  34566,
  87887,
  78009,
  43665]}

In [26]:
df = pandas.DataFrame(data)

In [27]:
df

   EMPID EMP_Name  EMP_Salary
0    101      Raj       24345
1    102      Anu       76654
2    103     Manu       87675
3    104    Rahul       23344
4    105      Ram       67563
5    106    Shyam       78999
6    107    Mohan       34566
7    108    Rohan       87887
8    109    Shiva       78009
9    110    Vikas       43665

In [28]:
# Aggreagte Functions

In [29]:
df.head()

   EMPID EMP_Name  EMP_Salary
0    101      Raj       24345
1    102      Anu       76654
2    103     Manu       87675
3    104    Rahul       23344
4    105      Ram       67563

In [30]:
df['EMP_Salary']

0    24345
1    76654
2    87675
3    23344
4    67563
5    78999
6    34566
7    87887
8    78009
9    43665
Name: EMP_Salary, dtype: int64

In [31]:
df.EMP_Salary

0    24345
1    76654
2    87675
3    23344
4    67563
5    78999
6    34566
7    87887
8    78009
9    43665
Name: EMP_Salary, dtype: int64

In [32]:
df.EMP_Salary.sum()

np.int64(602707)

In [33]:
df.EMP_Salary.max()

np.int64(87887)

In [34]:
df.EMP_Salary.min()

np.int64(23344)

In [35]:
df.EMP_Salary.count()

np.int64(10)

In [37]:
print("Average Salary" ,df.EMP_Salary.sum()/df.EMP_Salary.count() )

Average Salary 60270.7

In [39]:
data = {
    'EMPID':[101,102,103,104,105,106,107,108,109,110],
    'EMP_Name':['Raj','Anu',np.nan,'Rahul','Ram','Shyam',np.nan,'Rohan','Shiva','Vikas'],
    'EMP_Salary':[24345,np.nan,87675,23344,67563,np.nan,34566,np.nan,78009,43665]
}

In [83]:
df = pandas.DataFrame(data)

In [41]:
df

   EMPID EMP_Name  EMP_Salary
0    101      Raj     24345.0
1    102      Anu         NaN
2    103      NaN     87675.0
3    104    Rahul     23344.0
4    105      Ram     67563.0
5    106    Shyam         NaN
6    107      NaN     34566.0
7    108    Rohan         NaN
8    109    Shiva     78009.0
9    110    Vikas     43665.0

In [42]:
df.isnull()

   EMPID  EMP_Name  EMP_Salary
0  False     False       False
1  False     False        True
2  False      True       False
3  False     False       False
4  False     False       False
5  False     False        True
6  False      True       False
7  False     False        True
8  False     False       False
9  False     False       False

In [43]:
df.isnull().sum()

EMPID         0
EMP_Name      2
EMP_Salary    3
dtype: int64

In [44]:
df.isnull().sum().sum()

np.int64(5)

In [48]:
df.EMP_Salary.isnull().sum()

np.int64(3)

In [49]:
df

   EMPID EMP_Name  EMP_Salary
0    101      Raj     24345.0
1    102      Anu         NaN
2    103      NaN     87675.0
3    104    Rahul     23344.0
4    105      Ram     67563.0
5    106    Shyam         NaN
6    107      NaN     34566.0
7    108    Rohan         NaN
8    109    Shiva     78009.0
9    110    Vikas     43665.0

In [51]:
df.EMP_Salary.sum()

np.float64(359167.0)

In [55]:
df = df.dropna()

In [56]:
df

   EMPID EMP_Name  EMP_Salary
0    101      Raj     24345.0
3    104    Rahul     23344.0
4    105      Ram     67563.0
8    109    Shiva     78009.0
9    110    Vikas     43665.0

In [57]:
df.to_csv('abcd.csv')

In [59]:
df

   EMPID EMP_Name  EMP_Salary
0    101      Raj     24345.0
1    102      Anu         NaN
2    103      NaN     87675.0
3    104    Rahul     23344.0
4    105      Ram     67563.0
5    106    Shyam         NaN
6    107      NaN     34566.0
7    108    Rohan         NaN
8    109    Shiva     78009.0
9    110    Vikas     43665.0

In [60]:
df.dropna()

   EMPID EMP_Name  EMP_Salary
0    101      Raj     24345.0
3    104    Rahul     23344.0
4    105      Ram     67563.0
8    109    Shiva     78009.0
9    110    Vikas     43665.0

In [61]:
# remove /Dropna  =>   0.0% - 1.0%

In [62]:
# replace / repair

In [63]:
# fillna

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EMPID       10 non-null     int64
 1   EMP_Name    8 non-null      object
 2   EMP_Salary  7 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 372.0+ bytes

In [67]:
df = df.fillna(value='Missing_Value')

In [68]:
df

   EMPID       EMP_Name     EMP_Salary
0    101            Raj        24345.0
1    102            Anu  Missing_Value
2    103  Missing_Value        87675.0
3    104          Rahul        23344.0
4    105            Ram        67563.0
5    106          Shyam  Missing_Value
6    107  Missing_Value        34566.0
7    108          Rohan  Missing_Value
8    109          Shiva        78009.0
9    110          Vikas        43665.0

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EMPID       10 non-null     int64
 1   EMP_Name    10 non-null     object
 2   EMP_Salary  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [71]:
df

   EMPID EMP_Name  EMP_Salary
0    101      Raj     24345.0
1    102      Anu         NaN
2    103      NaN     87675.0
3    104    Rahul     23344.0
4    105      Ram     67563.0
5    106    Shyam         NaN
6    107      NaN     34566.0
7    108    Rohan         NaN
8    109    Shiva     78009.0
9    110    Vikas     43665.0

In [73]:
df.EMP_Name.fillna(value='Unknown_Name',inplace=True)

C:\Users\Croma Campus\AppData\Local\Temp\ipykernel_17832\2766513730.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.EMP_Name.fillna(value='Unknown_Name',inplace=True)

In [74]:
df

   EMPID      EMP_Name  EMP_Salary
0    101           Raj     24345.0
1    102           Anu         NaN
2    103  Unknown_Name     87675.0
3    104         Rahul     23344.0
4    105           Ram     67563.0
5    106         Shyam         NaN
6    107  Unknown_Name     34566.0
7    108         Rohan         NaN
8    109         Shiva     78009.0
9    110         Vikas     43665.0

In [75]:
df.EMP_Salary.sum()

np.float64(359167.0)

In [76]:
df.EMP_Salary.sum()/df.EMP_Salary.count()

np.float64(51309.57142857143)

In [77]:
df.EMP_Salary.isnull().sum()

np.int64(3)

In [79]:
df.EMP_Salary.fillna(value=0,inplace=True)

C:\Users\Croma Campus\AppData\Local\Temp\ipykernel_17832\3500300130.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.EMP_Salary.fillna(value=0,inplace=True)

In [80]:
df

   EMPID      EMP_Name  EMP_Salary
0    101           Raj     24345.0
1    102           Anu         0.0
2    103  Unknown_Name     87675.0
3    104         Rahul     23344.0
4    105           Ram     67563.0
5    106         Shyam         0.0
6    107  Unknown_Name     34566.0
7    108         Rohan         0.0
8    109         Shiva     78009.0
9    110         Vikas     43665.0

In [81]:
df.EMP_Salary.sum()

np.float64(359167.0)

In [82]:
df.EMP_Salary.sum()/df.EMP_Salary.count()

np.float64(35916.7)

In [84]:
df

   EMPID EMP_Name  EMP_Salary
0    101      Raj     24345.0
1    102      Anu         NaN
2    103      NaN     87675.0
3    104    Rahul     23344.0
4    105      Ram     67563.0
5    106    Shyam         NaN
6    107      NaN     34566.0
7    108    Rohan         NaN
8    109    Shiva     78009.0
9    110    Vikas     43665.0

In [85]:
df.EMP_Name.mode()

0      Anu
1    Rahul
2      Raj
3      Ram
4    Rohan
5    Shiva
6    Shyam
7    Vikas
Name: EMP_Name, dtype: object

In [87]:
df.EMP_Name.fillna(value=df.EMP_Name.mode()[0] , inplace=True)

C:\Users\Croma Campus\AppData\Local\Temp\ipykernel_17832\1387152996.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.EMP_Name.fillna(value=df.EMP_Name.mode()[0] , inplace=True)

In [89]:
df.EMP_Salary.sum()/df.EMP_Salary.count()

np.float64(51309.57142857143)

In [90]:
df.EMP_Salary.fillna(value=df.EMP_Salary.sum()/df.EMP_Salary.count() , inplace=True)

In [91]:
df

   EMPID EMP_Name    EMP_Salary
0    101      Raj  24345.000000
1    102      Anu  51309.571429
2    103      Anu  87675.000000
3    104    Rahul  23344.000000
4    105      Ram  67563.000000
5    106    Shyam  51309.571429
6    107      Anu  34566.000000
7    108    Rohan  51309.571429
8    109    Shiva  78009.000000
9    110    Vikas  43665.000000

In [92]:
df.EMP_Salary.sum()/df.EMP_Salary.count()

np.float64(51309.57142857143)

In [95]:
data = {
    'EMPID':[101,102,103,104,104,106,107,104,107,110],
    'EMP_Name':['Raj','Anu','Manu','Rahul','Ram','Shyam','Mohan','Rohan','Shiva','Vikas'],
    'EMP_Salary':[24345,76654,87675,23344,67563,78999,34566,87887,78009,43665]
}

In [117]:
df = pandas.DataFrame(data)

In [98]:
df

   EMPID EMP_Name  EMP_Salary
0    101      Raj       24345
1    102      Anu       76654
2    103     Manu       87675
3    104    Rahul       23344
4    104      Ram       67563
5    106    Shyam       78999
6    107    Mohan       34566
7    104    Rohan       87887
8    107    Shiva       78009
9    110    Vikas       43665

In [100]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [101]:
df.EMPID.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7     True
8     True
9    False
Name: EMPID, dtype: bool

In [118]:
df.EMPID = df.EMPID.drop_duplicates()

In [120]:
df.dropna(inplace=True)

In [121]:
df

   EMPID EMP_Name  EMP_Salary
0  101.0      Raj       24345
1  102.0      Anu       76654
2  103.0     Manu       87675
3  104.0    Rahul       23344
5  106.0    Shyam       78999
6  107.0    Mohan       34566
9  110.0    Vikas       43665